from telethon import TelegramClient, events, sync

api_id= 27357586
api_hash= '2593c17784dde9bca0de9b6384932376'


client = TelegramClient('anon', api_id, api_hash)


@client.on(events.NewMessage)
async def my_event_handler(event):
    if '.soo' in event.raw_text:
        await event.edit("S")
        await event.edit("U")
        await event.edit("L")
        await event.edit("T")
        await event.edit("O")
        await event.edit("N")
        await event.edit("K")
        await event.edit("H")
        await event.edit("O")
        await event.edit('N')
        await event.edit("O")
        await event.edit("V")
        await event.edit(' ')
        await event.edit('O')
        await event.edit('R')
        await event.edit('I')
        await event.edit('F')
        await event.edit("K")
        await event.edit("H")
        await event.edit("O")
        await event.edit("N")
    elif '.hi' in event.raw_text:
        await event.edit("S|")
        await event.edit("Sa|")
        await event.edit("Sal|")
        await event.edit("Salo|")
        await event.edit("Salom")
        await event.edit("Salom")
        await event.edit("Salom")
        await event.edit("╔┓┏╦━╦┓╔┓╔━━╗\n║┗┛║┗╣┃║┃║X X║\n║┏┓║┏╣┗╣┗╣╰╯║\n╚┛┗╩━╩━╩━╩━━╝")

    elif '.pc' in event.raw_text:
        await event.edit("🔴🔴🔴🔴🖱🖱🔵🔵🔵🔵\n🔴🔴🔴🔴🖱🖱🔵🔵🔵🔵\n🔴🔴🔴🔴🖱🖱🔵🔵🔵🔵")
        await event.edit("🔵🔵🔵🔵🖱🖱🔴🔴🔴🔴\n🔵🔵🔵🔵🖱🖱🔴🔴🔴🔴\n🔵🔵🔵🔵🖱🖱🔴🔴🔴🔴")
        await event.edit("🔴🔴🔴🔴🖱🖱🔵🔵🔵🔵\n🔴🔴🔴🔴🖱🖱🔵🔵🔵🔵\n🔴🔴🔴🔴🖱🖱🔵🔵🔵🔵")
        await event.edit("🔵🔵🔵🔵🖱🖱🔴🔴🔴🔴\n🔵🔵🔵🔵🖱🖱🔴🔴🔴🔴\n🔵🔵🔵🔵🖱🖱🔴🔴🔴🔴")
        await event.edit("🔴🔴🔴🔴🖱🖱🔵🔵🔵🔵\n🔴🔴🔴🔴🖱🖱🔵🔵🔵🔵\n🔴🔴🔴🔴🖱🖱🔵🔵🔵🔵")
        await event.edit("🔵🔵🔵🔵🖱🖱🔴🔴🔴🔴\n🔵🔵🔵🔵🖱🖱🔴🔴🔴🔴\n🔵🔵🔵🔵🖱🖱🔴🔴🔴🔴")
        await event.edit("🔴🔴🔴🔴🖱🖱🔵🔵🔵🔵\n🔴🔴🔴🔴🖱🖱🔵🔵🔵🔵\n🔴🔴🔴🔴🖱🖱🔵🔵🔵🔵")
        await event.edit("🔵🔵🔵🔵🖱🖱🔴🔴🔴🔴\n🔵🔵🔵🔵🖱🖱🔴🔴🔴🔴\n🔵🔵🔵🔵🖱🖱🔴🔴🔴🔴")
        await event.edit("🔴🔴🔴🔴🖱🖱🔵🔵🔵🔵\n🔴🔴🔴🔴🖱🖱🔵🔵🔵🔵\n🔴🔴🔴🔴🖱🖱🔵🔵🔵🔵")
        await event.edit("🔵🔵🔵🔵🖱🖱🔴🔴🔴🔴\n🔵🔵🔵🔵🖱🖱🔴🔴🔴🔴\n🔵🔵🔵🔵🖱🖱🔴🔴🔴🔴")
        await event.edit("🔴🔴🔴🔴🖱🖱🔵🔵🔵🔵\n🔴🔴🔴🔴🖱🖱🔵🔵🔵🔵\n🔴🔴🔴🔴🖱🖱🔵🔵🔵🔵")
        await event.edit("🔵🔵🔵🔵🖱🖱🔴🔴🔴🔴\n🔵🔵🔵🔵🖱🖱🔴🔴🔴🔴\n🔵🔵🔵🔵🖱🖱🔴🔴🔴🔴")
        await event.edit("🔴🔴🔴🔴🖱🖱🔵🔵🔵🔵\n🔴🔴🔴🔴🖱🖱🔵🔵🔵🔵\n🔴🔴🔴🔴🖱🖱🔵🔵🔵🔵")
        await event.edit("🔵🔵🔵🔵🖱🖱🔴🔴🔴🔴\n🔵🔵🔵🔵🖱🖱🔴🔴🔴🔴\n🔵🔵🔵🔵🖱🖱🔴🔴🔴🔴")
        await event.edit("🔴🔴🔴🔴🖱🖱🔵🔵🔵🔵\n🔴🔴🔴🔴🖱🖱🔵🔵🔵🔵\n🔴🔴🔴🔴🖱🖱🔵🔵🔵🔵")
        await event.edit("🔵🔵🔵🔵🖱🖱🔴🔴🔴🔴\n🔵🔵🔵🔵🖱🖱🔴🔴🔴🔴\n🔵🔵🔵🔵🖱🖱🔴🔴🔴🔴")
        await event.edit("🔴🔴🔴🔴🖱🖱🔵🔵🔵🔵\n🔴🔴🔴🔴🖱🖱🔵🔵🔵🔵\n🔴🔴🔴🔴🖱🖱🔵🔵🔵🔵")
        await event.edit("🔵🔵🔵🔵🖱🖱🔴🔴🔴🔴\n🔵🔵🔵🔵🖱🖱🔴🔴🔴🔴\n🔵🔵🔵🔵🖱🖱🔴🔴🔴🔴")
        await event.edit("🔴🔴🔴🔴🖱🖱🔵🔵🔵🔵\n🔴🔴🔴🔴🖱🖱🔵🔵🔵🔵\n🔴🔴🔴🔴🖱🖱🔵🔵🔵🔵")
        await event.edit("🔵🔵🔵🔵🖱🖱🔴🔴🔴🔴\n🔵🔵🔵🔵🖱🖱🔴🔴🔴🔴\n🔵🔵🔵🔵🖱🖱🔴🔴🔴🔴")
        await event.edit("🔴🔴🔴🔴🖱🖱🔵🔵🔵🔵\n🔴🔴🔴🔴🖱🖱🔵🔵🔵🔵\n🔴🔴🔴🔴🖱🖱🔵🔵🔵🔵")
        await event.edit("🔵🔵🔵🔵🖱🖱🔴🔴🔴🔴\n🔵🔵🔵🔵🖱🖱🔴🔴🔴🔴\n🔵🔵🔵🔵🖱🖱🔴🔴🔴🔴")
        await event.edit("🔴🔴🔴🔴🖱🖱🔵🔵🔵🔵\n🔴🔴🔴🔴🖱🖱🔵🔵🔵🔵\n🔴🔴🔴🔴🖱🖱🔵🔵🔵🔵")
        await event.edit("🔵🔵🔵🔵🖱🖱🔴🔴🔴🔴\n🔵🔵🔵🔵🖱🖱🔴🔴🔴🔴\n🔵🔵🔵🔵🖱🖱🔴🔴🔴🔴")
        await event.edit("🔴🔴🔴🔴🖱🖱🔵🔵🔵🔵\n🔴🔴🔴🔴🖱🖱🔵🔵🔵🔵\n🔴🔴🔴🔴🖱🖱🔵🔵🔵🔵")
        await event.edit("🔵🔵🔵🔵🖱🖱🔴🔴🔴🔴\n🔵🔵🔵🔵🖱🖱🔴🔴🔴🔴\n🔵🔵🔵🔵🖱🖱🔴🔴🔴🔴")
        await event.edit("🔴🔴🔴🔴🖱🖱🔵🔵🔵🔵\n🔴🔴🔴🔴🖱🖱🔵🔵🔵🔵\n🔴🔴🔴🔴🖱🖱🔵🔵🔵🔵")
        await event.edit("🔵🔵🔵🔵🖱🖱🔴🔴🔴🔴\n🔵🔵🔵🔵🖱🖱🔴🔴🔴🔴\n🔵🔵🔵🔵🖱🖱🔴🔴🔴🔴")
        await event.edit("🔴🔴🔴🔴🖱🖱🔵🔵🔵🔵\n🔴🔴🔴🔴🖱🖱🔵🔵🔵🔵\n🔴🔴🔴🔴🖱🖱🔵🔵🔵🔵")
        await event.edit("🔵🔵🔵🔵🖱🖱🔴🔴🔴🔴\n🔵🔵🔵🔵🖱🖱🔴🔴🔴🔴\n🔵🔵🔵🔵🖱🖱🔴🔴🔴🔴")
        await event.edit("🔴🔴🔴🔴🖱🖱🔵🔵🔵🔵\n🔴🔴🔴🔴🖱🖱🔵🔵🔵🔵\n🔴🔴🔴🔴🖱🖱🔵🔵🔵🔵")
        await event.edit("🔵🔵🔵🔵🖱🖱🔴🔴🔴🔴\n🔵🔵🔵🔵🖱🖱🔴🔴🔴🔴\n🔵🔵🔵🔵🖱🖱🔴🔴🔴🔴")
        await event.edit("🔴🔴🔴🔴🖱🖱🔵🔵🔵🔵\n🔴🔴🔴🔴🖱🖱🔵🔵🔵🔵\n🔴🔴🔴🔴🖱🖱🔵🔵🔵🔵")
        await event.edit("🔵🔵🔵🔵🖱🖱🔴🔴🔴🔴\n🔵🔵🔵🔵🖱🖱🔴🔴🔴🔴\n🔵🔵🔵🔵🖱🖱🔴🔴🔴🔴")
        await event.edit("🔴🔴🔴🔴🖱🖱🔵🔵🔵🔵\n🔴🔴🔴🔴🖱🖱🔵🔵🔵🔵\n🔴🔴🔴🔴🖱🖱🔵🔵🔵🔵")
        await event.edit("🔵🔵🔵🔵🖱🖱🔴🔴🔴🔴\n🔵🔵🔵🔵🖱🖱🔴🔴🔴🔴\n🔵🔵🔵🔵🖱🖱🔴🔴🔴🔴")
        await event.edit("🔴🔴🔴🔴🖱🖱🔵🔵🔵🔵\n🔴🔴🔴🔴🖱🖱🔵🔵🔵🔵\n🔴🔴🔴🔴🖱🖱🔵🔵🔵🔵")
        await event.edit("🔵🔵🔵🔵🖱🖱🔴🔴🔴🔴\n🔵🔵🔵🔵🖱🖱🔴🔴🔴🔴\n🔵🔵🔵🔵🖱🖱🔴🔴🔴🔴")
        await event.edit("🔴🔴🔴🔴🖱🖱🔵🔵🔵🔵\n🔴🔴🔴🔴🖱🖱🔵🔵🔵🔵\n🔴🔴🔴🔴🖱🖱🔵🔵🔵🔵")
        await event.edit("🔵🔵🔵🔵🖱🖱🔴🔴🔴🔴\n🔵🔵🔵🔵🖱🖱🔴🔴🔴🔴\n🔵🔵🔵🔵🖱🖱🔴🔴🔴🔴")
        await event.edit("🔴🔴🔴🔴🖱🖱🔵🔵🔵🔵\n🔴🔴🔴🔴🖱🖱🔵🔵🔵🔵\n🔴🔴🔴🔴🖱🖱🔵🔵🔵🔵")
        await event.edit("🔵🔵🔵🔵🖱🖱🔴🔴🔴🔴\n🔵🔵🔵🔵🖱🖱🔴🔴🔴🔴\n🔵🔵🔵🔵🖱🖱🔴🔴🔴🔴")
        await event.edit("🔴🔴🔴🔴🖱🖱🔵🔵🔵🔵\n🔴🔴🔴🔴🖱🖱🔵🔵🔵🔵\n🔴🔴🔴🔴🖱🖱🔵🔵🔵🔵")
        await event.edit("🔵🔵🔵🔵🖱🖱🔴🔴🔴🔴\n🔵🔵🔵🔵🖱🖱🔴🔴🔴🔴\n🔵🔵🔵🔵🖱🖱🔴🔴🔴🔴")
        await event.edit("🔴🔴🔴🔴🖱🖱🔵🔵🔵🔵\n🔴🔴🔴🔴🖱🖱🔵🔵🔵🔵\n🔴🔴🔴🔴🖱🖱🔵🔵🔵🔵")
        await event.edit("🔵🔵🔵🔵🖱🖱🔴🔴🔴🔴\n🔵🔵🔵🔵🖱🖱🔴🔴🔴🔴\n🔵🔵🔵🔵🖱🖱🔴🔴🔴🔴")
        await event.edit("🔴🔴🔴🔴🖱🖱🔵🔵🔵🔵\n🔴🔴🔴🔴🖱🖱🔵🔵🔵🔵\n🔴🔴🔴🔴🖱🖱🔵🔵🔵🔵")
        await event.edit("🔵🔵🔵🔵🖱🖱🔴🔴🔴🔴\n🔵🔵🔵🔵🖱🖱🔴🔴🔴🔴\n🔵🔵🔵🔵🖱🖱🔴🔴🔴🔴")
        await event.edit("Tugadi...")
        


    
    elif '.attack' in event.raw_text:
        await event.edit("seach:ip")
        await event.edit("seach:ip")
        await event.edit("seach:ip")
        await event.edit("ip:102,12,23,33")
        await event.edit("ip:102,12,23,33")
        await event.edit("Start:DDoS")
        await event.edit("Start:DDoS")
        await event.edit("finish DDoS")
        await event.edit("hacked")



    elif '.x' in event.raw_text:
        await event.edit("◼️◼️◼️◼️◼️◼️◼️\n◼️◼️◼️😜◼️◼️◼️\n◼️⬜️◻️⬜️◻️⬜️◼️\n◼️◼️◼️⬜️◼️◼️◼️\n◼️◼️⬜️◻️⬜️◼️◼️\n◼️◼️◻️◼️◻️◼️◼️")
        await event.edit("◼️◼️◼️◼️◼️◼️◼️\n◼️◼️◼️😜◼️◼️◼️\n⬜️◻️⬜️◻️⬜️◼️◼️\n◼️◼️◼️⬜️◼️◼️◼️\n◼️◼️⬜️◻️⬜️◼️◼️\n◼️◼️◻️◼️◻️◼️◼️")
        await event.edit("◼️◼️◼️◼️◼️◼️◼️\n◼️◼️◼️😜◼️◼️◼️\n◼️◼️⬜️◻️⬜️◻️⬜️\n◼️◼️◼️⬜️◼️◼️◼️\n◼️◼️⬜️◻️⬜️◼️◼️\n◼️◼️◻️◼️◻️◼️◼️")
        await event.edit("◼️◼️◼️◼️◼️◼️◼️\n◼️◼️◼️😜◼️◼️◼️\n◼️⬜️◻️⬜️◻️⬜️◼️\n◼️◼️◼️⬜️◼️◼️◼️\n◼️◼️⬜️◻️⬜️◼️◼️\n◼️◼️◻️◼️◻️◼️◼️")
        await event.edit("◼️◼️◼️◼️◼️◼️◼️\n◼️◼️◼️😜◼️◼️◼️\n⬜️◻️⬜️◻️⬜️◼️◼️\n◼️◼️◼️⬜️◼️◼️◼️\n◼️◼️⬜️◻️⬜️◼️◼️\n◼️◼️◻️◼️◻️◼️◼️")
        await event.edit("◼️◼️◼️◼️◼️◼️◼️\n◼️◼️◼️😜◼️◼️◼️\n◼️◼️⬜️◻️⬜️◻️⬜️\n◼️◼️◼️⬜️◼️◼️◼️\n◼️◼️⬜️◻️⬜️◼️◼️\n◼️◼️◻️◼️◻️◼️◼️")
        await event.edit("◼️◼️◼️◼️◼️◼️◼️\n◼️◼️◼️😜◼️◼️◼️\n◼️⬜️◻️⬜️◻️⬜️◼️\n◼️◼️◼️⬜️◼️◼️◼️\n◼️◼️⬜️◻️⬜️◼️◼️\n◼️◼️◻️◼️◻️◼️◼️")
        await event.edit("◼️◼️◼️◼️◼️◼️◼️\n◼️◼️◼️😜◼️◼️◼️\n⬜️◻️⬜️◻️⬜️◼️◼️\n◼️◼️◼️⬜️◼️◼️◼️\n◼️◼️⬜️◻️⬜️◼️◼️\n◼️◼️◻️◼️◻️◼️◼️")
        await event.edit("◼️◼️◼️◼️◼️◼️◼️\n◼️◼️◼️😜◼️◼️◼️\n◼️◼️⬜️◻️⬜️◻️⬜️\n◼️◼️◼️⬜️◼️◼️◼️\n◼️◼️⬜️◻️⬜️◼️◼️\n◼️◼️◻️◼️◻️◼️◼️")
        await event.edit("◼️◼️◼️◼️◼️◼️◼️\n◼️◼️◼️😜◼️◼️◼️\n◼️⬜️◻️⬜️◻️⬜️◼️\n◼️◼️◼️⬜️◼️◼️◼️\n◼️◼️⬜️◻️⬜️◼️◼️\n◼️◼️◻️◼️◻️◼️◼️")
        await event.edit("◼️◼️◼️◼️◼️◼️◼️\n◼️◼️◼️😜◼️◼️◼️\n⬜️◻️⬜️◻️⬜️◼️◼️\n◼️◼️◼️⬜️◼️◼️◼️\n◼️◼️⬜️◻️⬜️◼️◼️\n◼️◼️◻️◼️◻️◼️◼️")
        await event.edit("◼️◼️◼️◼️◼️◼️◼️\n◼️◼️◼️😜◼️◼️◼️\n◼️◼️⬜️◻️⬜️◻️⬜️\n◼️◼️◼️⬜️◼️◼️◼️\n◼️◼️⬜️◻️⬜️◼️◼️\n◼️◼️◻️◼️◻️◼️◼️")

    
    elif '.caput' in event.raw_text:
        await event.edit("✈️")
        await event.edit("ㅤ✈️")
        await event.edit("ㅤㅤ✈️")
        await event.edit("ㅤㅤ🛩")
        await event.edit("ㅤ🛩")
        await event.edit("🛩")
        await event.edit("💥")

    elif '.love' in event.raw_text:
        await event.edit(" 🩷")
        await event.edit("❤️")
        await event.edit("🧡")
        await event.edit("💛")
        await event.edit("💚")
        await event.edit("🩵")
        await event.edit(" 💙")
        await event.edit("💜")
        await event.edit("🖤")
        await event.edit("🩶")
        await event.edit("🤍")
        await event.edit("🤎")
       
   elif '.bm' in event.raw_text:
        bitmoji= ['>', '>-', '<',"::",":-",":-)"] # list kopro qilasiz
        for e in bitmoji:
            await event.edit(e)





	



client.start()
client.run_until_disconnected()